; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 669948 2 2 4 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph0 - mode
	thermograph3 - mode
	spectrograph1 - mode
	image2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(have_image Phenomenon3 spectrograph1)
	(have_image Phenomenon4 image2)
	(have_image Phenomenon5 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
2. (turn_to satellite1 phenomenon5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 3
3. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 3
4. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 3
5. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 3
6. (take_image satellite1 phenomenon5 instrument2 image2)
   added: (have_image phenomenon5 image2)
   goals met: 1 of 3
7. (turn_to satellite1 phenomenon4 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon4)
   goals met: 1 of 3
8. (take_image satellite1 phenomenon4 instrument2 image2)
   added: (have_image phenomenon4 image2)
   goals met: 2 of 3
9. (turn_to satellite1 phenomenon3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon3)
   goals met: 2 of 3
10. (take_image satellite1 phenomenon3 instrument2 spectrograph1)
   added: (have_image phenomenon3 spectrograph1)
   goals met: 3 of 3
